backend/perf/results/redis-attribution-full-100-k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: perf/booking-preauthenticated.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 5m30s max duration (incl. graceful stop):
              * booking_preauthenticated: 1 iterations for each of 100 VUs (maxDuration: 5m0s, gracefulStop: 30s)


running (0m00.7s), 100/100 VUs, 0 complete and 0 interrupted iterations
booking_preauthenticated   [   0% ] 100 VUs  0m00.7s/5m0s  000/100 iters, 1 per VU

running (0m01.7s), 100/100 VUs, 0 complete and 0 interrupted iterations
booking_preauthenticated   [   0% ] 100 VUs  0m01.7s/5m0s  000/100 iters, 1 per VU

running (0m02.7s), 100/100 VUs, 0 complete and 0 interrupted iterations
booking_preauthenticated   [   0% ] 100 VUs  0m02.7s/5m0s  000/100 iters, 1 per VU

running (0m03.7s), 100/100 VUs, 0 complete and 0 interrupted iterations
booking_preauthenticated   [   0% ] 100 VUs  0m03.7s/5m0s  000/100 iters, 1 per VU

running (0m04.7s), 100/100 VUs, 0 complete and 0 interrupted iterations
booking_preauthenticated   [   0% ] 100 VUs  0m04.7s/5m0s  000/100 iters, 1 per VU

running (0m05.7s), 100/100 VUs, 0 complete and 0 interrupted iterations
booking_preauthenticated   [   0% ] 100 VUs  0m05.7s/5m0s  000/100 iters, 1 per VU

running (0m06.7s), 100/100 VUs, 0 complete and 0 interrupted iterations
booking_preauthenticated   [   0% ] 100 VUs  0m06.7s/5m0s  000/100 iters, 1 per VU

running (0m07.7s), 100/100 VUs, 0 complete and 0 interrupted iterations
booking_preauthenticated   [   0% ] 100 VUs  0m07.7s/5m0s  000/100 iters, 1 per VU


  █ TOTAL RESULTS 

    CUSTOM
    expected_business_conflicts....: 0.00%  0 out of 100
    hold_latency_ms................: min=1.06s    avg=3.18s med=3.88s p(90)=5.21s p(95)=5.32s p(99)=5.6s  max=5.69s
    unexpected_failures............: 0.00%  0 out of 100

    HTTP
    http_req_duration..............: min=308.47ms avg=1.77s med=1.14s p(90)=4.77s p(95)=5.09s p(99)=5.38s max=5.69s
      { expected_response:true }...: min=308.47ms avg=1.77s med=1.14s p(90)=4.77s p(95)=5.09s p(99)=5.38s max=5.69s
    http_req_failed................: 0.00%  0 out of 500
    http_reqs......................: 500    61.518234/s

    EXECUTION
    iteration_duration.............: min=7.97s    avg=8.04s med=8.07s p(90)=8.09s p(95)=8.1s  p(99)=8.11s max=8.12s
    iterations.....................: 100    12.303647/s
    vus............................: 100    min=100      max=100
    vus_max........................: 100    min=100      max=100

    NETWORK
    data_received..................: 60 MB  7.4 MB/s
    data_sent......................: 299 kB 37 kB/s



running (0m08.1s), 000/100 VUs, 100 complete and 0 interrupted iterations
booking_preauthenticated ✓ [ 100% ] 100 VUs  0m08.1s/5m0s  100/100 iters, 1 per VU